RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mm_glb_reg.h
/**
  ******************************************************************************
  * @file    mm_glb_reg.h
  * @version V1.0
  * @date    2021-07-12
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __MM_GLB_REG_H__
#define __MM_GLB_REG_H__

#include "bl808.h"

/* 0x0 : mm_clk_ctrl_cpu */
#define MM_GLB_MM_CLK_CTRL_CPU_OFFSET        (0x0)
#define MM_GLB_REG_PLL_EN                    MM_GLB_REG_PLL_EN
#define MM_GLB_REG_PLL_EN_POS                (0U)
#define MM_GLB_REG_PLL_EN_LEN                (1U)
#define MM_GLB_REG_PLL_EN_MSK                (((1U << MM_GLB_REG_PLL_EN_LEN) - 1) << MM_GLB_REG_PLL_EN_POS)
#define MM_GLB_REG_PLL_EN_UMSK               (~(((1U << MM_GLB_REG_PLL_EN_LEN) - 1) << MM_GLB_REG_PLL_EN_POS))
#define MM_GLB_REG_CPU_CLK_EN                MM_GLB_REG_CPU_CLK_EN
#define MM_GLB_REG_CPU_CLK_EN_POS            (1U)
#define MM_GLB_REG_CPU_CLK_EN_LEN            (1U)
#define MM_GLB_REG_CPU_CLK_EN_MSK            (((1U << MM_GLB_REG_CPU_CLK_EN_LEN) - 1) << MM_GLB_REG_CPU_CLK_EN_POS)
#define MM_GLB_REG_CPU_CLK_EN_UMSK           (~(((1U << MM_GLB_REG_CPU_CLK_EN_LEN) - 1) << MM_GLB_REG_CPU_CLK_EN_POS))
#define MM_GLB_REG_BCLK_EN                   MM_GLB_REG_BCLK_EN
#define MM_GLB_REG_BCLK_EN_POS               (2U)
#define MM_GLB_REG_BCLK_EN_LEN               (1U)
#define MM_GLB_REG_BCLK_EN_MSK               (((1U << MM_GLB_REG_BCLK_EN_LEN) - 1) << MM_GLB_REG_BCLK_EN_POS)
#define MM_GLB_REG_BCLK_EN_UMSK              (~(((1U << MM_GLB_REG_BCLK_EN_LEN) - 1) << MM_GLB_REG_BCLK_EN_POS))
#define MM_GLB_REG_MM_CPU_CLK_EN             MM_GLB_REG_MM_CPU_CLK_EN
#define MM_GLB_REG_MM_CPU_CLK_EN_POS         (3U)
#define MM_GLB_REG_MM_CPU_CLK_EN_LEN         (1U)
#define MM_GLB_REG_MM_CPU_CLK_EN_MSK         (((1U << MM_GLB_REG_MM_CPU_CLK_EN_LEN) - 1) << MM_GLB_REG_MM_CPU_CLK_EN_POS)
#define MM_GLB_REG_MM_CPU_CLK_EN_UMSK        (~(((1U << MM_GLB_REG_MM_CPU_CLK_EN_LEN) - 1) << MM_GLB_REG_MM_CPU_CLK_EN_POS))
#define MM_GLB_REG_UART_CLK_SEL              MM_GLB_REG_UART_CLK_SEL
#define MM_GLB_REG_UART_CLK_SEL_POS          (4U)
#define MM_GLB_REG_UART_CLK_SEL_LEN          (2U)
#define MM_GLB_REG_UART_CLK_SEL_MSK          (((1U << MM_GLB_REG_UART_CLK_SEL_LEN) - 1) << MM_GLB_REG_UART_CLK_SEL_POS)
#define MM_GLB_REG_UART_CLK_SEL_UMSK         (~(((1U << MM_GLB_REG_UART_CLK_SEL_LEN) - 1) << MM_GLB_REG_UART_CLK_SEL_POS))
#define MM_GLB_REG_I2C_CLK_SEL               MM_GLB_REG_I2C_CLK_SEL
#define MM_GLB_REG_I2C_CLK_SEL_POS           (6U)
#define MM_GLB_REG_I2C_CLK_SEL_LEN           (1U)
#define MM_GLB_REG_I2C_CLK_SEL_MSK           (((1U << MM_GLB_REG_I2C_CLK_SEL_LEN) - 1) << MM_GLB_REG_I2C_CLK_SEL_POS)
#define MM_GLB_REG_I2C_CLK_SEL_UMSK          (~(((1U << MM_GLB_REG_I2C_CLK_SEL_LEN) - 1) << MM_GLB_REG_I2C_CLK_SEL_POS))
#define MM_GLB_REG_SPI_CLK_SEL               MM_GLB_REG_SPI_CLK_SEL
#define MM_GLB_REG_SPI_CLK_SEL_POS           (7U)
#define MM_GLB_REG_SPI_CLK_SEL_LEN           (1U)
#define MM_GLB_REG_SPI_CLK_SEL_MSK           (((1U << MM_GLB_REG_SPI_CLK_SEL_LEN) - 1) << MM_GLB_REG_SPI_CLK_SEL_POS)
#define MM_GLB_REG_SPI_CLK_SEL_UMSK          (~(((1U << MM_GLB_REG_SPI_CLK_SEL_LEN) - 1) << MM_GLB_REG_SPI_CLK_SEL_POS))
#define MM_GLB_REG_CPU_CLK_SEL               MM_GLB_REG_CPU_CLK_SEL
#define MM_GLB_REG_CPU_CLK_SEL_POS           (8U)
#define MM_GLB_REG_CPU_CLK_SEL_LEN           (2U)
#define MM_GLB_REG_CPU_CLK_SEL_MSK           (((1U << MM_GLB_REG_CPU_CLK_SEL_LEN) - 1) << MM_GLB_REG_CPU_CLK_SEL_POS)
#define MM_GLB_REG_CPU_CLK_SEL_UMSK          (~(((1U << MM_GLB_REG_CPU_CLK_SEL_LEN) - 1) << MM_GLB_REG_CPU_CLK_SEL_POS))
#define MM_GLB_REG_XCLK_CLK_SEL              MM_GLB_REG_XCLK_CLK_SEL
#define MM_GLB_REG_XCLK_CLK_SEL_POS          (10U)
#define MM_GLB_REG_XCLK_CLK_SEL_LEN          (1U)
#define MM_GLB_REG_XCLK_CLK_SEL_MSK          (((1U << MM_GLB_REG_XCLK_CLK_SEL_LEN) - 1) << MM_GLB_REG_XCLK_CLK_SEL_POS)
#define MM_GLB_REG_XCLK_CLK_SEL_UMSK         (~(((1U << MM_GLB_REG_XCLK_CLK_SEL_LEN) - 1) << MM_GLB_REG_XCLK_CLK_SEL_POS))
#define MM_GLB_REG_CPU_ROOT_CLK_SEL          MM_GLB_REG_CPU_ROOT_CLK_SEL
#define MM_GLB_REG_CPU_ROOT_CLK_SEL_POS      (11U)
#define MM_GLB_REG_CPU_ROOT_CLK_SEL_LEN      (1U)
#define MM_GLB_REG_CPU_ROOT_CLK_SEL_MSK      (((1U << MM_GLB_REG_CPU_ROOT_CLK_SEL_LEN) - 1) << MM_GLB_REG_CPU_ROOT_CLK_SEL_POS)
#define MM_GLB_REG_CPU_ROOT_CLK_SEL_UMSK     (~(((1U << MM_GLB_REG_CPU_ROOT_CLK_SEL_LEN) - 1) << MM_GLB_REG_CPU_ROOT_CLK_SEL_POS))
#define MM_GLB_REG_MMCPU0_CLK_EN             MM_GLB_REG_MMCPU0_CLK_EN
#define MM_GLB_REG_MMCPU0_CLK_EN_POS         (12U)
#define MM_GLB_REG_MMCPU0_CLK_EN_LEN         (1U)
#define MM_GLB_REG_MMCPU0_CLK_EN_MSK         (((1U << MM_GLB_REG_MMCPU0_CLK_EN_LEN) - 1) << MM_GLB_REG_MMCPU0_CLK_EN_POS)
#define MM_GLB_REG_MMCPU0_CLK_EN_UMSK        (~(((1U << MM_GLB_REG_MMCPU0_CLK_EN_LEN) - 1) << MM_GLB_REG_MMCPU0_CLK_EN_POS))
#define MM_GLB_REG_BCLK1X_SEL                MM_GLB_REG_BCLK1X_SEL
#define MM_GLB_REG_BCLK1X_SEL_POS            (13U)
#define MM_GLB_REG_BCLK1X_SEL_LEN            (2U)
#define MM_GLB_REG_BCLK1X_SEL_MSK            (((1U << MM_GLB_REG_BCLK1X_SEL_LEN) - 1) << MM_GLB_REG_BCLK1X_SEL_POS)
#define MM_GLB_REG_BCLK1X_SEL_UMSK           (~(((1U << MM_GLB_REG_BCLK1X_SEL_LEN) - 1) << MM_GLB_REG_BCLK1X_SEL_POS))
#define MM_GLB_REG_BCLK2X_DIV_ACT_PULSE      MM_GLB_REG_BCLK2X_DIV_ACT_PULSE
#define MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_POS  (18U)
#define MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_LEN  (1U)
#define MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_MSK  (((1U << MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_LEN) - 1) << MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_POS)
#define MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_UMSK (~(((1U << MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_LEN) - 1) << MM_GLB_REG_BCLK2X_DIV_ACT_PULSE_POS))
#define MM_GLB_REG_BCLK2X_DIV_BYPASS         MM_GLB_REG_BCLK2X_DIV_BYPASS
#define MM_GLB_REG_BCLK2X_DIV_BYPASS_POS     (19U)
#define MM_GLB_REG_BCLK2X_DIV_BYPASS_LEN     (1U)
#define MM_GLB_REG_BCLK2X_DIV_BYPASS_MSK     (((1U << MM_GLB_REG_BCLK2X_DIV_BYPASS_LEN) - 1) << MM_GLB_REG_BCLK2X_DIV_BYPASS_POS)
#define MM_GLB_REG_BCLK2X_DIV_BYPASS_UMSK    (~(((1U << MM_GLB_REG_BCLK2X_DIV_BYPASS_LEN) - 1) << MM_GLB_REG_BCLK2X_DIV_BYPASS_POS))
#define MM_GLB_STS_BCLK2X_PROT_DONE          MM_GLB_STS_BCLK2X_PROT_DONE
#define MM_GLB_STS_BCLK2X_PROT_DONE_POS      (20U)
#define MM_GLB_STS_BCLK2X_PROT_DONE_LEN      (1U)
#define MM_GLB_STS_BCLK2X_PROT_DONE_MSK      (((1U << MM_GLB_STS_BCLK2X_PROT_DONE_LEN) - 1) << MM_GLB_STS_BCLK2X_PROT_DONE_POS)
#define MM_GLB_STS_BCLK2X_PROT_DONE_UMSK     (~(((1U << MM_GLB_STS_BCLK2X_PROT_DONE_LEN) - 1) << MM_GLB_STS_BCLK2X_PROT_DONE_POS))
#define MM_GLB_REG_BCLK2X_SW_DONE_CNT        MM_GLB_REG_BCLK2X_SW_DONE_CNT
#define MM_GLB_REG_BCLK2X_SW_DONE_CNT_POS    (24U)
#define MM_GLB_REG_BCLK2X_SW_DONE_CNT_LEN    (4U)
#define MM_GLB_REG_BCLK2X_SW_DONE_CNT_MSK    (((1U << MM_GLB_REG_BCLK2X_SW_DONE_CNT_LEN) - 1) << MM_GLB_REG_BCLK2X_SW_DONE_CNT_POS)
#define MM_GLB_REG_BCLK2X_SW_DONE_CNT_UMSK   (~(((1U << MM_GLB_REG_BCLK2X_SW_DONE_CNT_LEN) - 1) << MM_GLB_REG_BCLK2X_SW_DONE_CNT_POS))
#define MM_GLB_CPU_CLK_SW_STATE              MM_GLB_CPU_CLK_SW_STATE
#define MM_GLB_CPU_CLK_SW_STATE_POS          (28U)
#define MM_GLB_CPU_CLK_SW_STATE_LEN          (3U)
#define MM_GLB_CPU_CLK_SW_STATE_MSK          (((1U << MM_GLB_CPU_CLK_SW_STATE_LEN) - 1) << MM_GLB_CPU_CLK_SW_STATE_POS)
#define MM_GLB_CPU_CLK_SW_STATE_UMSK         (~(((1U << MM_GLB_CPU_CLK_SW_STATE_LEN) - 1) << MM_GLB_CPU_CLK_SW_STATE_POS))

/* 0x4 : mm_clk_cpu */
#define MM_GLB_MM_CLK_CPU_OFFSET       (0x4)
#define MM_GLB_REG_CPU_CLK_DIV         MM_GLB_REG_CPU_CLK_DIV
#define MM_GLB_REG_CPU_CLK_DIV_POS     (0U)
#define MM_GLB_REG_CPU_CLK_DIV_LEN     (8U)
#define MM_GLB_REG_CPU_CLK_DIV_MSK     (((1U << MM_GLB_REG_CPU_CLK_DIV_LEN) - 1) << MM_GLB_REG_CPU_CLK_DIV_POS)
#define MM_GLB_REG_CPU_CLK_DIV_UMSK    (~(((1U << MM_GLB_REG_CPU_CLK_DIV_LEN) - 1) << MM_GLB_REG_CPU_CLK_DIV_POS))
#define MM_GLB_REG_CNN_CLK_DIV_EN      MM_GLB_REG_CNN_CLK_DIV_EN
#define MM_GLB_REG_CNN_CLK_DIV_EN_POS  (8U)
#define MM_GLB_REG_CNN_CLK_DIV_EN_LEN  (1U)
#define MM_GLB_REG_CNN_CLK_DIV_EN_MSK  (((1U << MM_GLB_REG_CNN_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_CNN_CLK_DIV_EN_POS)
#define MM_GLB_REG_CNN_CLK_DIV_EN_UMSK (~(((1U << MM_GLB_REG_CNN_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_CNN_CLK_DIV_EN_POS))
#define MM_GLB_REG_CNN_CLK_SEL         MM_GLB_REG_CNN_CLK_SEL
#define MM_GLB_REG_CNN_CLK_SEL_POS     (9U)
#define MM_GLB_REG_CNN_CLK_SEL_LEN     (2U)
#define MM_GLB_REG_CNN_CLK_SEL_MSK     (((1U << MM_GLB_REG_CNN_CLK_SEL_LEN) - 1) << MM_GLB_REG_CNN_CLK_SEL_POS)
#define MM_GLB_REG_CNN_CLK_SEL_UMSK    (~(((1U << MM_GLB_REG_CNN_CLK_SEL_LEN) - 1) << MM_GLB_REG_CNN_CLK_SEL_POS))
#define MM_GLB_REG_CNN_CLK_DIV         MM_GLB_REG_CNN_CLK_DIV
#define MM_GLB_REG_CNN_CLK_DIV_POS     (12U)
#define MM_GLB_REG_CNN_CLK_DIV_LEN     (3U)
#define MM_GLB_REG_CNN_CLK_DIV_MSK     (((1U << MM_GLB_REG_CNN_CLK_DIV_LEN) - 1) << MM_GLB_REG_CNN_CLK_DIV_POS)
#define MM_GLB_REG_CNN_CLK_DIV_UMSK    (~(((1U << MM_GLB_REG_CNN_CLK_DIV_LEN) - 1) << MM_GLB_REG_CNN_CLK_DIV_POS))
#define MM_GLB_REG_BCLK2X_DIV          MM_GLB_REG_BCLK2X_DIV
#define MM_GLB_REG_BCLK2X_DIV_POS      (16U)
#define MM_GLB_REG_BCLK2X_DIV_LEN      (8U)
#define MM_GLB_REG_BCLK2X_DIV_MSK      (((1U << MM_GLB_REG_BCLK2X_DIV_LEN) - 1) << MM_GLB_REG_BCLK2X_DIV_POS)
#define MM_GLB_REG_BCLK2X_DIV_UMSK     (~(((1U << MM_GLB_REG_BCLK2X_DIV_LEN) - 1) << MM_GLB_REG_BCLK2X_DIV_POS))
#define MM_GLB_REG_BCLK1X_DIV          MM_GLB_REG_BCLK1X_DIV
#define MM_GLB_REG_BCLK1X_DIV_POS      (24U)
#define MM_GLB_REG_BCLK1X_DIV_LEN      (8U)
#define MM_GLB_REG_BCLK1X_DIV_MSK      (((1U << MM_GLB_REG_BCLK1X_DIV_LEN) - 1) << MM_GLB_REG_BCLK1X_DIV_POS)
#define MM_GLB_REG_BCLK1X_DIV_UMSK     (~(((1U << MM_GLB_REG_BCLK1X_DIV_LEN) - 1) << MM_GLB_REG_BCLK1X_DIV_POS))

