RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mm_glb_reg.h
/* 0x8 : dsp2_dp_clk */
#define MM_GLB_DSP2_DP_CLK_OFFSET       (0x8)
#define MM_GLB_REG_DSP2_CLK_DIV_EN      MM_GLB_REG_DSP2_CLK_DIV_EN
#define MM_GLB_REG_DSP2_CLK_DIV_EN_POS  (0U)
#define MM_GLB_REG_DSP2_CLK_DIV_EN_LEN  (1U)
#define MM_GLB_REG_DSP2_CLK_DIV_EN_MSK  (((1U << MM_GLB_REG_DSP2_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_DSP2_CLK_DIV_EN_POS)
#define MM_GLB_REG_DSP2_CLK_DIV_EN_UMSK (~(((1U << MM_GLB_REG_DSP2_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_DSP2_CLK_DIV_EN_POS))
#define MM_GLB_REG_DSP2_CLK_SEL         MM_GLB_REG_DSP2_CLK_SEL
#define MM_GLB_REG_DSP2_CLK_SEL_POS     (1U)
#define MM_GLB_REG_DSP2_CLK_SEL_LEN     (2U)
#define MM_GLB_REG_DSP2_CLK_SEL_MSK     (((1U << MM_GLB_REG_DSP2_CLK_SEL_LEN) - 1) << MM_GLB_REG_DSP2_CLK_SEL_POS)
#define MM_GLB_REG_DSP2_CLK_SEL_UMSK    (~(((1U << MM_GLB_REG_DSP2_CLK_SEL_LEN) - 1) << MM_GLB_REG_DSP2_CLK_SEL_POS))
#define MM_GLB_REG_DSP2_CLK_DIV         MM_GLB_REG_DSP2_CLK_DIV
#define MM_GLB_REG_DSP2_CLK_DIV_POS     (8U)
#define MM_GLB_REG_DSP2_CLK_DIV_LEN     (8U)
#define MM_GLB_REG_DSP2_CLK_DIV_MSK     (((1U << MM_GLB_REG_DSP2_CLK_DIV_LEN) - 1) << MM_GLB_REG_DSP2_CLK_DIV_POS)
#define MM_GLB_REG_DSP2_CLK_DIV_UMSK    (~(((1U << MM_GLB_REG_DSP2_CLK_DIV_LEN) - 1) << MM_GLB_REG_DSP2_CLK_DIV_POS))
#define MM_GLB_REG_DP_CLK_DIV_EN       MM_GLB_REG_DP_CLK_DIV_EN
#define MM_GLB_REG_DP_CLK_DIV_EN_POS   (16U)
#define MM_GLB_REG_DP_CLK_DIV_EN_LEN   (1U)
#define MM_GLB_REG_DP_CLK_DIV_EN_MSK   (((1U << MM_GLB_REG_DP_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_DP_CLK_DIV_EN_POS)
#define MM_GLB_REG_DP_CLK_DIV_EN_UMSK  (~(((1U << MM_GLB_REG_DP_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_DP_CLK_DIV_EN_POS))
#define MM_GLB_REG_DP_CLK_SEL          MM_GLB_REG_DP_CLK_SEL
#define MM_GLB_REG_DP_CLK_SEL_POS      (17U)
#define MM_GLB_REG_DP_CLK_SEL_LEN      (1U)
#define MM_GLB_REG_DP_CLK_SEL_MSK      (((1U << MM_GLB_REG_DP_CLK_SEL_LEN) - 1) << MM_GLB_REG_DP_CLK_SEL_POS)
#define MM_GLB_REG_DP_CLK_SEL_UMSK     (~(((1U << MM_GLB_REG_DP_CLK_SEL_LEN) - 1) << MM_GLB_REG_DP_CLK_SEL_POS))
#define MM_GLB_REG_DP_CLK_DIV          MM_GLB_REG_DP_CLK_DIV
#define MM_GLB_REG_DP_CLK_DIV_POS      (20U)
#define MM_GLB_REG_DP_CLK_DIV_LEN      (4U)
#define MM_GLB_REG_DP_CLK_DIV_MSK      (((1U << MM_GLB_REG_DP_CLK_DIV_LEN) - 1) << MM_GLB_REG_DP_CLK_DIV_POS)
#define MM_GLB_REG_DP_CLK_DIV_UMSK     (~(((1U << MM_GLB_REG_DP_CLK_DIV_LEN) - 1) << MM_GLB_REG_DP_CLK_DIV_POS))

/* 0xC : codec_clk */
#define MM_GLB_CODEC_CLK_OFFSET         (0xC)
#define MM_GLB_REG_H264_CLK_DIV_EN      MM_GLB_REG_H264_CLK_DIV_EN
#define MM_GLB_REG_H264_CLK_DIV_EN_POS  (8U)
#define MM_GLB_REG_H264_CLK_DIV_EN_LEN  (1U)
#define MM_GLB_REG_H264_CLK_DIV_EN_MSK  (((1U << MM_GLB_REG_H264_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_H264_CLK_DIV_EN_POS)
#define MM_GLB_REG_H264_CLK_DIV_EN_UMSK (~(((1U << MM_GLB_REG_H264_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_H264_CLK_DIV_EN_POS))
#define MM_GLB_REG_H264_CLK_SEL         MM_GLB_REG_H264_CLK_SEL
#define MM_GLB_REG_H264_CLK_SEL_POS     (9U)
#define MM_GLB_REG_H264_CLK_SEL_LEN     (2U)
#define MM_GLB_REG_H264_CLK_SEL_MSK     (((1U << MM_GLB_REG_H264_CLK_SEL_LEN) - 1) << MM_GLB_REG_H264_CLK_SEL_POS)
#define MM_GLB_REG_H264_CLK_SEL_UMSK    (~(((1U << MM_GLB_REG_H264_CLK_SEL_LEN) - 1) << MM_GLB_REG_H264_CLK_SEL_POS))
#define MM_GLB_REG_H264_CLK_DIV         MM_GLB_REG_H264_CLK_DIV
#define MM_GLB_REG_H264_CLK_DIV_POS     (12U)
#define MM_GLB_REG_H264_CLK_DIV_LEN     (3U)
#define MM_GLB_REG_H264_CLK_DIV_MSK     (((1U << MM_GLB_REG_H264_CLK_DIV_LEN) - 1) << MM_GLB_REG_H264_CLK_DIV_POS)
#define MM_GLB_REG_H264_CLK_DIV_UMSK    (~(((1U << MM_GLB_REG_H264_CLK_DIV_LEN) - 1) << MM_GLB_REG_H264_CLK_DIV_POS))

/* 0x10 : mm_clk_ctrl_peri */
#define MM_GLB_MM_CLK_CTRL_PERI_OFFSET   (0x10)
#define MM_GLB_REG_I2C0_CLK_DIV          MM_GLB_REG_I2C0_CLK_DIV
#define MM_GLB_REG_I2C0_CLK_DIV_POS      (0U)
#define MM_GLB_REG_I2C0_CLK_DIV_LEN      (8U)
#define MM_GLB_REG_I2C0_CLK_DIV_MSK      (((1U << MM_GLB_REG_I2C0_CLK_DIV_LEN) - 1) << MM_GLB_REG_I2C0_CLK_DIV_POS)
#define MM_GLB_REG_I2C0_CLK_DIV_UMSK     (~(((1U << MM_GLB_REG_I2C0_CLK_DIV_LEN) - 1) << MM_GLB_REG_I2C0_CLK_DIV_POS))
#define MM_GLB_REG_I2C0_CLK_DIV_EN       MM_GLB_REG_I2C0_CLK_DIV_EN
#define MM_GLB_REG_I2C0_CLK_DIV_EN_POS   (8U)
#define MM_GLB_REG_I2C0_CLK_DIV_EN_LEN   (1U)
#define MM_GLB_REG_I2C0_CLK_DIV_EN_MSK   (((1U << MM_GLB_REG_I2C0_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_I2C0_CLK_DIV_EN_POS)
#define MM_GLB_REG_I2C0_CLK_DIV_EN_UMSK  (~(((1U << MM_GLB_REG_I2C0_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_I2C0_CLK_DIV_EN_POS))
#define MM_GLB_REG_I2C0_CLK_EN           MM_GLB_REG_I2C0_CLK_EN
#define MM_GLB_REG_I2C0_CLK_EN_POS       (9U)
#define MM_GLB_REG_I2C0_CLK_EN_LEN       (1U)
#define MM_GLB_REG_I2C0_CLK_EN_MSK       (((1U << MM_GLB_REG_I2C0_CLK_EN_LEN) - 1) << MM_GLB_REG_I2C0_CLK_EN_POS)
#define MM_GLB_REG_I2C0_CLK_EN_UMSK      (~(((1U << MM_GLB_REG_I2C0_CLK_EN_LEN) - 1) << MM_GLB_REG_I2C0_CLK_EN_POS))
#define MM_GLB_REG_UART0_CLK_DIV_EN      MM_GLB_REG_UART0_CLK_DIV_EN
#define MM_GLB_REG_UART0_CLK_DIV_EN_POS  (16U)
#define MM_GLB_REG_UART0_CLK_DIV_EN_LEN  (1U)
#define MM_GLB_REG_UART0_CLK_DIV_EN_MSK  (((1U << MM_GLB_REG_UART0_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_UART0_CLK_DIV_EN_POS)
#define MM_GLB_REG_UART0_CLK_DIV_EN_UMSK (~(((1U << MM_GLB_REG_UART0_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_UART0_CLK_DIV_EN_POS))
#define MM_GLB_REG_UART0_CLK_DIV         MM_GLB_REG_UART0_CLK_DIV
#define MM_GLB_REG_UART0_CLK_DIV_POS     (17U)
#define MM_GLB_REG_UART0_CLK_DIV_LEN     (3U)
#define MM_GLB_REG_UART0_CLK_DIV_MSK     (((1U << MM_GLB_REG_UART0_CLK_DIV_LEN) - 1) << MM_GLB_REG_UART0_CLK_DIV_POS)
#define MM_GLB_REG_UART0_CLK_DIV_UMSK    (~(((1U << MM_GLB_REG_UART0_CLK_DIV_LEN) - 1) << MM_GLB_REG_UART0_CLK_DIV_POS))
#define MM_GLB_REG_SPI_CLK_DIV_EN        MM_GLB_REG_SPI_CLK_DIV_EN
#define MM_GLB_REG_SPI_CLK_DIV_EN_POS    (23U)
#define MM_GLB_REG_SPI_CLK_DIV_EN_LEN    (1U)
#define MM_GLB_REG_SPI_CLK_DIV_EN_MSK    (((1U << MM_GLB_REG_SPI_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_SPI_CLK_DIV_EN_POS)
#define MM_GLB_REG_SPI_CLK_DIV_EN_UMSK   (~(((1U << MM_GLB_REG_SPI_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_SPI_CLK_DIV_EN_POS))
#define MM_GLB_REG_SPI_CLK_DIV           MM_GLB_REG_SPI_CLK_DIV
#define MM_GLB_REG_SPI_CLK_DIV_POS       (24U)
#define MM_GLB_REG_SPI_CLK_DIV_LEN       (8U)
#define MM_GLB_REG_SPI_CLK_DIV_MSK       (((1U << MM_GLB_REG_SPI_CLK_DIV_LEN) - 1) << MM_GLB_REG_SPI_CLK_DIV_POS)
#define MM_GLB_REG_SPI_CLK_DIV_UMSK      (~(((1U << MM_GLB_REG_SPI_CLK_DIV_LEN) - 1) << MM_GLB_REG_SPI_CLK_DIV_POS))

/* 0x18 : mm_clk_ctrl_peri3 */
#define MM_GLB_MM_CLK_CTRL_PERI3_OFFSET  (0x18)
#define MM_GLB_REG_I2C1_CLK_DIV          MM_GLB_REG_I2C1_CLK_DIV
#define MM_GLB_REG_I2C1_CLK_DIV_POS      (0U)
#define MM_GLB_REG_I2C1_CLK_DIV_LEN      (8U)
#define MM_GLB_REG_I2C1_CLK_DIV_MSK      (((1U << MM_GLB_REG_I2C1_CLK_DIV_LEN) - 1) << MM_GLB_REG_I2C1_CLK_DIV_POS)
#define MM_GLB_REG_I2C1_CLK_DIV_UMSK     (~(((1U << MM_GLB_REG_I2C1_CLK_DIV_LEN) - 1) << MM_GLB_REG_I2C1_CLK_DIV_POS))
#define MM_GLB_REG_I2C1_CLK_DIV_EN       MM_GLB_REG_I2C1_CLK_DIV_EN
#define MM_GLB_REG_I2C1_CLK_DIV_EN_POS   (8U)
#define MM_GLB_REG_I2C1_CLK_DIV_EN_LEN   (1U)
#define MM_GLB_REG_I2C1_CLK_DIV_EN_MSK   (((1U << MM_GLB_REG_I2C1_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_I2C1_CLK_DIV_EN_POS)
#define MM_GLB_REG_I2C1_CLK_DIV_EN_UMSK  (~(((1U << MM_GLB_REG_I2C1_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_I2C1_CLK_DIV_EN_POS))
#define MM_GLB_REG_I2C1_CLK_EN           MM_GLB_REG_I2C1_CLK_EN
#define MM_GLB_REG_I2C1_CLK_EN_POS       (9U)
#define MM_GLB_REG_I2C1_CLK_EN_LEN       (1U)
#define MM_GLB_REG_I2C1_CLK_EN_MSK       (((1U << MM_GLB_REG_I2C1_CLK_EN_LEN) - 1) << MM_GLB_REG_I2C1_CLK_EN_POS)
#define MM_GLB_REG_I2C1_CLK_EN_UMSK      (~(((1U << MM_GLB_REG_I2C1_CLK_EN_LEN) - 1) << MM_GLB_REG_I2C1_CLK_EN_POS))
#define MM_GLB_REG_UART1_CLK_DIV_EN      MM_GLB_REG_UART1_CLK_DIV_EN
#define MM_GLB_REG_UART1_CLK_DIV_EN_POS  (16U)
#define MM_GLB_REG_UART1_CLK_DIV_EN_LEN  (1U)
#define MM_GLB_REG_UART1_CLK_DIV_EN_MSK  (((1U << MM_GLB_REG_UART1_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_UART1_CLK_DIV_EN_POS)
#define MM_GLB_REG_UART1_CLK_DIV_EN_UMSK (~(((1U << MM_GLB_REG_UART1_CLK_DIV_EN_LEN) - 1) << MM_GLB_REG_UART1_CLK_DIV_EN_POS))
#define MM_GLB_REG_UART1_CLK_DIV         MM_GLB_REG_UART1_CLK_DIV
#define MM_GLB_REG_UART1_CLK_DIV_POS     (17U)
#define MM_GLB_REG_UART1_CLK_DIV_LEN     (3U)
#define MM_GLB_REG_UART1_CLK_DIV_MSK     (((1U << MM_GLB_REG_UART1_CLK_DIV_LEN) - 1) << MM_GLB_REG_UART1_CLK_DIV_POS)
#define MM_GLB_REG_UART1_CLK_DIV_UMSK    (~(((1U << MM_GLB_REG_UART1_CLK_DIV_LEN) - 1) << MM_GLB_REG_UART1_CLK_DIV_POS))

/* 0x40 : mm_sw_sys_reset */
#define MM_GLB_MM_SW_SYS_RESET_OFFSET     (0x40)
#define MM_GLB_REG_CTRL_SYS_RESET         MM_GLB_REG_CTRL_SYS_RESET
#define MM_GLB_REG_CTRL_SYS_RESET_POS     (0U)
#define MM_GLB_REG_CTRL_SYS_RESET_LEN     (1U)
#define MM_GLB_REG_CTRL_SYS_RESET_MSK     (((1U << MM_GLB_REG_CTRL_SYS_RESET_LEN) - 1) << MM_GLB_REG_CTRL_SYS_RESET_POS)
#define MM_GLB_REG_CTRL_SYS_RESET_UMSK    (~(((1U << MM_GLB_REG_CTRL_SYS_RESET_LEN) - 1) << MM_GLB_REG_CTRL_SYS_RESET_POS))
#define MM_GLB_REG_CTRL_PWRON_RST         MM_GLB_REG_CTRL_PWRON_RST
#define MM_GLB_REG_CTRL_PWRON_RST_POS     (2U)
#define MM_GLB_REG_CTRL_PWRON_RST_LEN     (1U)
#define MM_GLB_REG_CTRL_PWRON_RST_MSK     (((1U << MM_GLB_REG_CTRL_PWRON_RST_LEN) - 1) << MM_GLB_REG_CTRL_PWRON_RST_POS)
#define MM_GLB_REG_CTRL_PWRON_RST_UMSK    (~(((1U << MM_GLB_REG_CTRL_PWRON_RST_LEN) - 1) << MM_GLB_REG_CTRL_PWRON_RST_POS))
#define MM_GLB_REG_CTRL_MMCPU0_RESET      MM_GLB_REG_CTRL_MMCPU0_RESET
#define MM_GLB_REG_CTRL_MMCPU0_RESET_POS  (8U)
#define MM_GLB_REG_CTRL_MMCPU0_RESET_LEN  (1U)
#define MM_GLB_REG_CTRL_MMCPU0_RESET_MSK  (((1U << MM_GLB_REG_CTRL_MMCPU0_RESET_LEN) - 1) << MM_GLB_REG_CTRL_MMCPU0_RESET_POS)
#define MM_GLB_REG_CTRL_MMCPU0_RESET_UMSK (~(((1U << MM_GLB_REG_CTRL_MMCPU0_RESET_LEN) - 1) << MM_GLB_REG_CTRL_MMCPU0_RESET_POS))

