RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mm_glb_reg.h
    /* 0x44 : sw_reset_mm_peri */
    union {
        struct {
            uint32_t swrst_mm_misc  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t swrst_dma      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t swrst_uart0    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t swrst_i2c0     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t swrst_i2c1     : 1;  /* [    4],        r/w,        0x0 */
            uint32_t swrst_ipc      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t swrst_dma2d    : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7     : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t swrst_spi      : 1;  /* [    8],        r/w,        0x0 */
            uint32_t swrst_timer    : 1;  /* [    9],        r/w,        0x0 */
            uint32_t swrst_i2s0     : 1;  /* [   10],        r/w,        0x0 */
            uint32_t swrst_i2s1     : 1;  /* [   11],        r/w,        0x0 */
            uint32_t swrst_pdm0     : 1;  /* [   12],        r/w,        0x0 */
            uint32_t swrst_pdm1     : 1;  /* [   13],        r/w,        0x0 */
            uint32_t swrst_uart1    : 1;  /* [   14],        r/w,        0x0 */
            uint32_t swrst_pUHS     : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sw_reset_mm_peri;

    /* 0x48 : sw_reset_dsp2_sub */
    union {
        struct {
            uint32_t swrst_dsp2_misc  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t swrst_dsp2_main  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t swrst_dsp2_tsrc  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t swrst_dp_tsrc   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t swrst_nr3d_ctrl : 1;  /* [    4],        r/w,        0x0 */
            uint32_t swrst_dvp2busA  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t swrst_dvp2busB  : 1;  /* [    6],        r/w,        0x0 */
            uint32_t swrst_dvp2busC  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t swrst_dvp2busD  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t swrst_mipi      : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_15  : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t swrst_dsp2_reg   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t swrst_dvp2busE  : 1;  /* [   17],        r/w,        0x0 */
            uint32_t swrst_dvp2busF  : 1;  /* [   18],        r/w,        0x0 */
            uint32_t swrst_dvp2busG  : 1;  /* [   19],        r/w,        0x0 */
            uint32_t swrst_dvp2busH  : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31  : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sw_reset_dsp2_sub;

    /* 0x4C : sw_reset_codec_sub */
    union {
        struct {
            uint32_t swrst_codec_misc : 1;  /* [    0],        r/w,        0x0 */
            uint32_t swrst_mjpeg      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t swrst_h264       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t swrst_mjpeg_dec  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t swrst_cnn        : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_15    : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t swrst_vram       : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sw_reset_codec_sub;

    /* 0x50 : image_sensor_ctrl */
    union {
        struct {
            uint32_t rg_is_rst_n   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } image_sensor_ctrl;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[12];

    /* 0x60 : tz_mm_clkrst */
    union {
        struct {
            uint32_t tzc_mm_swrst_lock      : 1;  /* [    0],          r,        0x0 */
            uint32_t tzc_mm_sys_reset_lock  : 1;  /* [    1],          r,        0x0 */
            uint32_t tzc_mm_pwron_rst_lock  : 1;  /* [    2],          r,        0x0 */
            uint32_t tzc_mm_cpu0_reset_lock : 1;  /* [    3],          r,        0x0 */
            uint32_t tzc_mm_clk_lock        : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_31          : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tz_mm_clkrst;
};

typedef volatile struct mm_glb_reg mm_glb_reg_t;

#endif /* __MM_GLB_REG_H__ */
